asschmidt/lakerobotics/lrplatform/src/target/stm32/lib_bsp_nucleo103_cube/hal/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define B1_EXTI_IRQn EXTI15_10_IRQn
#define ANA_M2_Pin GPIO_PIN_0
#define ANA_M2_GPIO_Port GPIOC
#define ANA_M1_Pin GPIO_PIN_1
#define ANA_M1_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define ENCA_M1_Pin GPIO_PIN_6
#define ENCA_M1_GPIO_Port GPIOA
#define ENCB_M1_Pin GPIO_PIN_7
#define ENCB_M1_GPIO_Port GPIOA
#define LED1_Pin GPIO_PIN_1
#define LED1_GPIO_Port GPIOB
#define LED2_Pin GPIO_PIN_2
#define LED2_GPIO_Port GPIOB
#define EN_M2_Pin GPIO_PIN_13
#define EN_M2_GPIO_Port GPIOB
#define INA_M2_Pin GPIO_PIN_14
#define INA_M2_GPIO_Port GPIOB
#define INB_M2_Pin GPIO_PIN_15
#define INB_M2_GPIO_Port GPIOB
#define EN_M1_Pin GPIO_PIN_6
#define EN_M1_GPIO_Port GPIOC
#define INB_M1_Pin GPIO_PIN_7
#define INB_M1_GPIO_Port GPIOC
#define INA_M1_Pin GPIO_PIN_8
#define INA_M1_GPIO_Port GPIOC
#define PWM_M1_Pin GPIO_PIN_8
#define PWM_M1_GPIO_Port GPIOA
#define PWM_M2_Pin GPIO_PIN_9
#define PWM_M2_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define ENCA_M2_Pin GPIO_PIN_6
#define ENCA_M2_GPIO_Port GPIOB
#define ENCB_M2_Pin GPIO_PIN_7
#define ENCB_M2_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
